Dlubal.DynamPro.MassMatrixType
Mass matrix type

Dlubal.DynamPro.MassMatrixType.UnknownMatrixType
Unknown type

Dlubal.DynamPro.MassMatrixType.1
Unknown type

Dlubal.DynamPro.MassMatrixType.DiagonalMatrixType
Diagonal mass matrix

Dlubal.DynamPro.MassMatrixType.MatrixTypeWithTorsionalElements
Diagonal mass matrix with torsional elements (RFEM only)

Dlubal.DynamPro.MassMatrixType.ConsistentMatrixType
Consistent mass matrix

Dlubal.DynamPro.MassMatrixType.UnitMatrixType
Unit mass matrix